# Gold Rate Puzzle

Source: https://msbiskills.com/2015/03/22/t-sql-query-gold-rate-puzzle/

In the puzzle we have gold rate changing all the time. We have to find the start date, end Date and the gold rate at that duration. If the gold rate is changed then only we have create a new row. Please check the sample input and the expected output.

In [1]:
%run Question.ipynb

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
9 rows affected.
9 rows affected.

# Part A

Place the dates into groups, where the start of each date group is marked with "1" and consecutive dates are marked with "0".

In [2]:
%%sql

SELECT 
    *,
    CASE 
    WHEN rate = LAG(rate, 1) 
        OVER (ORDER BY dt) 
    THEN 0 
    ELSE 1
    END as start_of_seq
FROM rates

 * postgresql://fknight:***@localhost/postgres
9 rows affected.

[(datetime.date(2014, 9, 18), 27000, 1),
 (datetime.date(2014, 9, 19), 27000, 0),
 (datetime.date(2014, 9, 20), 31000, 1),
 (datetime.date(2014, 9, 21), 31000, 0),
 (datetime.date(2014, 9, 22), 31000, 0),
 (datetime.date(2014, 9, 23), 32000, 1),
 (datetime.date(2014, 9, 24), 31000, 1),
 (datetime.date(2014, 9, 25), 32000, 1),
 (datetime.date(2014, 9, 26), 27000, 1)]

# Part B

Using the subquery above, give each date group a ranking.

In [3]:
%%sql

WITH binary_seq AS (
    SELECT 
        *,
        CASE 
        WHEN rate = LAG(rate, 1) 
            OVER (ORDER BY dt) 
        THEN 0 
        ELSE 1
        END as start_of_seq
    FROM rates    
)

SELECT 
    *, 
    SUM(start_of_seq) OVER (ORDER BY dt) AS date_rank
FROM binary_seq

 * postgresql://fknight:***@localhost/postgres
9 rows affected.

[(datetime.date(2014, 9, 18), 27000, 1, 1),
 (datetime.date(2014, 9, 19), 27000, 0, 1),
 (datetime.date(2014, 9, 20), 31000, 1, 2),
 (datetime.date(2014, 9, 21), 31000, 0, 2),
 (datetime.date(2014, 9, 22), 31000, 0, 2),
 (datetime.date(2014, 9, 23), 32000, 1, 3),
 (datetime.date(2014, 9, 24), 31000, 1, 4),
 (datetime.date(2014, 9, 25), 32000, 1, 5),
 (datetime.date(2014, 9, 26), 27000, 1, 6)]

# Part C

Use the two previous subqueries to solve the original problem.

In [4]:
%%sql

WITH binary_seq AS (
    SELECT 
        *,
        CASE 
        WHEN rate = LAG(rate, 1) 
            OVER (ORDER BY dt) 
        THEN 0 
        ELSE 1
        END as start_of_seq
    FROM rates    
),

ranks AS (
    SELECT 
        *, 
        SUM(start_of_seq) OVER (ORDER BY dt) AS date_rank
    FROM binary_seq
)

SELECT 
    MIN(dt) as StartDate, 
    MAX(dt) as EndDate, 
    MAX(Rate) as Rate 
FROM ranks 
GROUP BY date_rank 
ORDER BY StartDate;

 * postgresql://fknight:***@localhost/postgres
6 rows affected.

[(datetime.date(2014, 9, 18), datetime.date(2014, 9, 19), 27000),
 (datetime.date(2014, 9, 20), datetime.date(2014, 9, 22), 31000),
 (datetime.date(2014, 9, 23), datetime.date(2014, 9, 23), 32000),
 (datetime.date(2014, 9, 24), datetime.date(2014, 9, 24), 31000),
 (datetime.date(2014, 9, 25), datetime.date(2014, 9, 25), 32000),
 (datetime.date(2014, 9, 26), datetime.date(2014, 9, 26), 27000)]

## The full solution is given below

In [6]:
%%sql

WITH binary_seq AS (
    SELECT 
        *,
        CASE 
        WHEN rate = LAG(rate, 1) 
            OVER (ORDER BY dt) 
        THEN 0 
        ELSE 1
        END as start_of_seq
    FROM rates    
),

ranks AS (
    SELECT 
        *, 
        SUM(start_of_seq) OVER (ORDER BY dt) AS date_rank
    FROM binary_seq
)

SELECT 
    MIN(dt) as StartDate, 
    MAX(dt) as EndDate, 
    MAX(Rate) as Rate 
FROM ranks 
GROUP BY date_rank 
ORDER BY StartDate;

 * postgresql://fknight:***@localhost/postgres
6 rows affected.

[(datetime.date(2014, 9, 18), datetime.date(2014, 9, 19), 27000),
 (datetime.date(2014, 9, 20), datetime.date(2014, 9, 22), 31000),
 (datetime.date(2014, 9, 23), datetime.date(2014, 9, 23), 32000),
 (datetime.date(2014, 9, 24), datetime.date(2014, 9, 24), 31000),
 (datetime.date(2014, 9, 25), datetime.date(2014, 9, 25), 32000),
 (datetime.date(2014, 9, 26), datetime.date(2014, 9, 26), 27000)]